Repository: PrestaShop/autoupgrade
Catalog: translations/ModulesAutoupgradeAdmin.*.xlf
Languages: cs, ru

source: [TECHNICAL ERROR] ajax-upgradetab.php is missing. Please reinstall the module.
cs: [TECHNICAL ERROR] Chybí ajax-upgradetab.php. Prosím přeinstalujte modul.
ru: [TECHNICAL ERROR] Отсутствует ajax-upgradetab.php. Переустановите модуль.

source: Click to refresh the page and use the new configuration
cs: Klepnutím aktualizujte stránku a použijte novou konfiguraci
ru: Нажмите, чтобы обновить страницу и использовать новую конфигурацию

source: Error detected during
cs: Byla zjištěna chyba během
ru: Возникла ошибка при

source: The request exceeded the max_time_limit. Please change your server configuration.
cs: Požadavek překročil max_time_limit. Upravte prosím konfiguraci serveru.
ru: Запрос превысил max_time_limit. Пожалуйста, измените конфигурацию вашего сервера.

source: See or hide the list
cs: Zobrazit nebo skrýt seznam
ru: Показать или спрятать список

source: Core file(s)
cs: Soubory jádra
ru: Основные файлы

source: Mail file(s)
cs: Soubory mailů
ru: Файл(ы) почты

source: Translation file(s)
cs: Soubor(y) překladů
ru: Файл(ы) переводов

source: Link and MD5 hash cannot be empty
cs: Link a MD5 hash nemůžou být prázdné
ru: Ссылка и хэш MD5 не могут быть пустыми

source: You need to enter the version number associated with the archive.
cs: Musíte zadat číslo verze přidružené k archivu.
ru: Вы должны указать номер версии, связанный с архивом.

source: No archive has been selected.
cs: Žádný archiv nebyl vybrán.
ru: Архив не выбран.

source: You need to enter the version number associated with the directory.
cs: Musíte zadat číslo verze přidružené k adresáři.
ru: Вы должны указать номер версии для этой директории.

source: Please confirm that you want to skip the backup.
cs: Prosím potvrďte, že si opravdu přejete přeskočit zálohu.
ru: Подтвердите пропуск резервного копирования.

source: Please confirm that you want to preserve file options.
cs: Prosím potvrďte, že si opravdu přejete zachovat nastavení souboru.
ru: Подтвердите, что хотите сохранить параметры файлов.

source: Less options
cs: Méně možností
ru: Меньше настроек

source: These files will be deleted
cs: Tyto soubory budou smazány
ru: Эти файлы будут удалены

source: These files will be replaced
cs: Tyto soubory budou nahrazeny
ru: Эти файлы будут заменены

source: No XML file has been selected.
cs: Nebyl vybrán žádný soubor XML.

source: No archive and no XML file have been selected.
cs: Nebyl vybrán žádný archiv a XML soubor.

source: [SKIP] directory "%s" does not exist and cannot be emptied.
cs: [SKIP] adresář "%s" neexistuje a nemůže být vyprázdněn.
ru: [SKIP] директории "%s" не существует, её невозможно удалить.

source: [CLEANING CACHE] File %s removed
cs: [CLEANING CACHE] %s byl odstraněn
ru: [CLEANING CACHE] Файл %s удалён

source: Cleaning file cache
cs: Čistím cache souborů

source: Running opcache_reset
cs: Spouštím opcache_reset

source: You already have the %s version.
cs: Již máte verzi %s.
ru: У вас уже установлена %s версия.

source: Initializing required environment constants
cs: Inicializace požadovaných konstant prostředí

source: Checking version validity
cs: Kontrola platnosti verze

source: Checking connection to database
cs: Kontrola připojení k databázi

source: Invalid database configuration
cs: Neplatná konfigurace databáze
ru: Неправильная конфигурация базы данных

source: Disabling all non native modules
cs: Vypínám všechny externí moduly

source: Keeping non native modules enabled
cs: Nechávám externí moduly zapnuté

source: Updating database data and structure
cs: Aktualizuji data a strukturu databáze

source: Running generic queries
cs: Spouštím obecné dotazy

source: Database upgrade OK
cs: Upgrade databáze OK
ru: Обновление базы данных успешно

source: Upgrading languages
cs: Aktualizuji jazyky

source: Regenerating htaccess
cs: Přegenerovávám htaccess

source: Cleaning XML files
cs: Čištění XML souborů

source: Disabling overrides
cs: Vypínám overridy

source: Keeping overrides in place
cs: Nechávám overridy na místě

source: Warning detected during upgrade.
cs: Během aktualizace bylo zjištěno varování.
ru: В процессе обновления возникли предупреждения.

source: Database upgrade completed
cs: Aktualizace databáze dokončena
ru: Обновление базы данных завершено

source: %s is not a valid version number.
cs: %s není platným číslem verze.
ru: %s не является допустимым номером версии.

source: [ERROR] Version to install is too old.
cs: [ERROR] Verze k instalaci je příliš stará.
ru: [ERROR] Устанавливаемая версия слишком стара.

source: Current version: %oldversion%. Version to install: %newversion%.
cs: Současná verze: %oldversion%. Verze k nainstalování: %newversion%.
ru: Текущая версия: %oldversion%. Будет установлена: %newversion%.

source: Unable to find upgrade directory in the installation path.
cs: V cestě pro instalaci nebylo možné nalézt složku pro aktualizaci.
ru: Невозможно найти директорию обновлений в установочном пути.

source: Error while loading SQL upgrade file "%s".
cs: Chyba při načítání souboru aktualizace SQL "%s".

source: Cannot find the SQL upgrade files. Please check that the %s folder is not empty.
cs: Nebylo možné najít soubory s aktualizací SQL. Prosím zkontrolujte, zda není složka %s prázdná.
ru: Невозможно найти SQL-файлы обновления. Убедитесь, что директория %s не пуста.

source: [DROP] SQL %s table has been dropped.
cs: [DROP] SQL %s tabulka byla zahozena.
ru: [DROP] SQL таблица %s удалена.

source: Keeping current theme
cs: Nechávám současnou šablonu

source: Switching to default theme.
cs: Přepínání na výchozí šablonu.

source: Upgrade the RTL files of back-office themes.
cs: Upgradovat RTL soubory témat back-office.

source: Upgrade the RTL files of front-office themes.
cs: Upgraduji RTL soubory front-office šablon.

source: Download of the language pack %lang% failed. %details%
cs: Stáhování jazykového balíčku %lang% selhalo. %details%

source: Error while updating translations for the language pack %lang%. %details%
cs: Při aktualizaci překladů jazykového balíčku %lang% došlo k chybě. %details%

source: %lang% is not a valid iso code, skipping
cs: %lang% není platný iso kód, přeskakuji

source: Downloading language pack for %lang%
cs: Stahování jazykového balíčku pro %lang%

source: Installing %lang% language pack
cs: Instaluji jazykový balíček %lang%

source: Generating mail templates for %lang%
cs: Generování emailových šablon pro %lang%

source: Cannot generate email templates: %s.
cs: E-mailové šablony nelze vygenerovat: %s.
ru: Невозможно создать шаблоны email: %s.

source: API keys not present in parameters, generating
cs: Klíče API nejsou přítomny v parametrech, generování

source: Keys generated using openssl_pkey_new, exporting private and public keys
cs: Klíče vygenerované pomocí openssl_pkey_new, export soukromých a veřejných klíčů

source: Updating parameters file
cs: Aktualizace souboru parameters

source: Unable to migrate parameters
cs: Nepodařilo se zmigrovat soubor parameters

source: Invalidating opcache for parameters file
cs: Ruší se platnost opcache pro soubor parameters

source: Parameters file updated
cs: Soubor parameters aktualizován

source: [ERROR] %dir% does not exist or is not a directory.
cs: [ERROR] %dir% neexistuje, nebo se nejedná o složku.

source: [ERROR] %s does not exist or is not a directory.
cs: [ERROR] %s neexistuje, nebo se nejedná o složku.

source: [WARNING] An error occurred while downloading module %s, the received file is empty.
cs: [VAROVÁNÍ] Při stahování modulu %s došlo k chybě, stažený soubor je prázdný.

source: Local module %s successfully copied.
cs: Místní modul %s byl úspěšně zkopírován.

source: Can not found or copy local module %s. Trying to download it from Addons.
cs: Nelze najít nebo zkopírovat místní modul %s. Pokusím se ho stáhnout z Addons.

source: [WARNING] No response from Addons server.
cs: [VAROVÁNÍ] Žádná odpověď ze serveru Addons.

source: [WARNING] Unable to write module %s's zip file in temporary directory.
cs: [VAROVÁNÍ] Nelze zapsat soubor zip modulu %s do dočasného adresáře.

source: Module %s has been successfully downloaded from Addons.
cs: Modul %s byl úspěšně stažen z Addons.

source: No version present in database for module %s, all files for upgrade will be applied.
cs: V databázi není žádná verze modulu %s, použijí se všechny soubory pro upgrade.

source: (%s/%s) Applying migration file %s.
cs: (%s/%s) Aplikuji migrační soubor %s.

source: [WARNING] Method %s already exists. Migration for module %s aborted, you can try again later on the module manager. Module %s disabled.
cs: [VAROVÁNÍ] Metoda %s již existuje. Migrace modulu %s byla přerušena, můžete to zkusit znovu později ve správci modulů. Modul %s byl zakázán.

source: [WARNING] Method %s does not exist. Module %s disabled.
cs: [VAROVÁNÍ] Metoda %s neexistuje. Modul %s zakázán.

source: [WARNING] Migration failed while running the file %s. Module %s disabled.
cs: [VAROVÁNÍ] Migrace selhala při spouštění souboru %s. Modul %s byl zakázán.

source: [WARNING] Unexpected error when trying to upgrade module %s. Module %s disabled.
cs: [VAROVÁNÍ] Neočekávaná chyba při pokusu o upgrade modulu %s. Modul %s byl zakázán.

source: [WARNING] Module %s version could not be updated. Database might be unavailable.
cs: [VAROVÁNÍ] Verzi modulu %s nelze aktualizovat. Databáze může být nedostupná.

source: [WARNING] Error when trying to extract module %s.
cs: [WARNING] Chyba při pokusu o rozbalení modulu %s.

source: [NOTICE] File %s does not exist, merge skipped.
cs: [NOTICE] Soubor %s neexistuje. Sloučení bylo přeskočeno.
ru: [NOTICE] Файл %s не существует, слияние пропущено.

source: [WARNING] %variablename% variable missing in file %filename%. Merge skipped.
cs: [WARNING] Proměnná %variablename% chybí v souboru %filename%. Slučování přeskočeno.
ru: [WARNING] В файле %filename% отсутствует переменная %variablename%. Слияние пропущено.

source: [WARNING] %variablename% variable missing in file %filename%. File %filename% deleted and merge skipped.
cs: [WARNING] Proměnná %variablename% chybí v souboru %filename%. Soubor %filename% smazán a slučování přeskočeno.
ru: [WARNING] В файле %filename% отсутствует переменная %variablename%. Файл %filename% удалён, слияние пропущено.

source: Unable to create directory %s
cs: Adresář %s nelze vytvořit
ru: Невозможно создать директорию %s

source: Cannot write to the directory. Please ensure you have the necessary write permissions on "%s".
cs: Do složky nelze zapisovat. Ujistěte se, že máte potřebná oprávnění k zápisu do "%s".

source: Error when trying to add %filename% to archive %archive%.
cs: Chyba při pokusu o přidání %filename% do archivu %archive%.
ru: Ошибка при попытке добавления %filename% в архив %archive%.

source: %filename% added to archive. %filescount% files left.
cs: %filename% přidán do archivu. Zbývá %filescount% souborů.
ru: Файл %filename% добавлен в архив. Осталось файлов: %filescount%.

source: Could not close the Zip file: %toFile% properly. Check you are allowed to write on the disk and there is available space on it.
cs: Zip soubor %toFile% se nepodařilo správně zavřít. Zkontrolujte, zda máte povoleno zapisovat na disk a zda je na něm volné místo.

source: %s is not a file
cs: %s není soubor
ru: %s не является файлом

source: Unable to create directory %s.
cs: Nebylo možné vytvořit složku %s.
ru: Не могу создать директорию %s.

source: Could not extract %file% from backup, the destination might not be writable.
cs: Nelze rozbalit %file% ze zálohy, cílová složka možná není zapisovatelné.

source: Content of archive %zip% is extracted
cs: Obsah archivu %zip% byl rozbalen

source: [ERROR] Unable to list archived files
cs: [ERROR] Nebylo možné získat seznam souborů v archivu
ru: [ERROR] Невозможно прочесть файлы в архиве

source: File %filename% (size: %filesize%) has been skipped during backup.
cs: Soubor %filename% (velikost: %filesize%) byl během zálohy přeskočen.
ru: Файл %filename% (размер: %filesize%) пропущен при резервном копировании.

source: Unable to open zipFile %s
cs: Nebylo možné otevřít soubor zip %s
ru: Не могу открыть zip файл %s

source: Unable to create the directory "%s"
cs: Nebylo možné vytvořit adresář "%s"
ru: Невозможно создать директорию "%s"

source: Unable to write in the directory "%s"
cs: Nelze zapisovat do adresáře "%s"

source: Unable to create file %s
cs: Nebylo možné vytvořit soubor %s
ru: Невозможно создать файл %s

source: Error when trying to delete backups %s
cs: Chyba při pokusu o smazání zálohy %s
ru: Ошибка при удалении резервных копий %s

source: The module %s requires PHP %s to work properly. Please upgrade your server configuration.
cs: Modul %s vyžaduje ke správnému fungování PHP %s. Upravte prosím nastavení serveru.

source: Activity Log
cs: Log aktivity
ru: Журнал активности

source: Currently processing
cs: Probíhá zpracování
ru: В данный момент обрабатывается

source: Analyzing the situation...
cs: Probíhá analýza situace...
ru: Анализ ситуации...

source: Errors
cs: Chyby
ru: Ошибки

source: Report a bug
cs: Nahlásit chybu

source: Give feedbacks
cs: Poskytnout zpětnou vazbu

source: Description
cs: Popis
ru: Описание

source: Give us details about the error
cs: Sdělte nám podrobnosti o chybě

source: Cancel
cs: Zrušit
ru: Отмена

source: Send a bug report
cs: Poslat chybové hlášení

source: Branch:
cs: Vývojová větev:
ru: Ветка:

source: Available
cs: Dostupný
ru: доступно

source: Unavailable
cs: Nedostupné
ru: недоступно

source: Name:
cs: Název:
ru: Название:

source: Version number:
cs: Číslo verze:
ru: Номер версии:

source: URL:
cs: Adresa URL:

source: MD5 hash:
cs: Kontrolní součet MD5:
ru: Хеш MD5:

source: Changelog:
cs: Seznam změn:
ru: Журнал изменений:

source: See changelog
cs: Zobrazit seznam změn

source: The pre-Upgrade checklist
cs: Kontrolní seznam před aktualizací
ru: Контрольный список проверок, необходимых до начала обновления

source: Your current version of the module is out of date. Update now
cs: Nainstalovaná verze modulu je zastaralá, aktualizujte ho

source: Modules > Module Manager > Updates
cs: Moduly > Správce modulů > Aktualizace

source: The checklist is not OK. You can only upgrade your shop once all indicators are green.
cs: Kontrolní seznam není v pořádku. Aktualizaci obchodu lze provést pouze v případě, že jsou všechny položky seznamu zelené.
ru: Проверьте контрольный список! Обновление можно начинать только в том случае, когда все индикаторы зелёного цвета.

source: Before starting the upgrade process, please make sure this checklist is all green.
cs: Před zahájením procesu aktualizace se ujistěte, že tento seznam je celý zelený.
ru: Перед началом обновления убедитесь, что все пункты контрольного списка выделены зеленым цветом.

source: Your current PHP version isn't compatible with your PrestaShop version. (Expected: %s - %s | Current: %s)
cs: Aktuální nastavená verze PHP není kompatibilní s vaší verzí PrestaShopu. (Podporováno: %s - %s | Aktuální: %s)

source: We were unable to check your PHP compatibility with the destination PrestaShop version.
cs: Nepodařilo se nám zkontrolovat kompatibilitu verze PHP s cílovou verzí PrestaShopu.

source: Your store's root directory (%s) is writable (with appropriate CHMOD permissions).
cs: Kořenový adresář obchodu (%s) je zapisovatelný (má odpovídající oprávnění CHMOD).

source: The "/admin/autoupgrade" directory is writable (appropriate CHMOD permissions)
cs: Složka "/admin/autoupgrade" je zapisovatelná (s patřičnými oprávněními CHMOD)
ru: В каталог "/admin/autoupgrade" разрешена запись (с соответствующими разрешениями CHMOD)

source: PHP's "Safe mode" option is turned off
cs: Volba PHP "safe mode" je vypnuta
ru: Режим PHP "Safe mode" отключен

source: PHP's "allow_url_fopen" option is turned on, or cURL is installed
cs: Volba PHP "allow_url_fopen" je zapnuta, nebo je nainstalováno rozšíření cURL
ru: Параметр РНР "allow_url_fopen" включен или установлен cURL

source: PHP's "zip" extension is enabled
cs: Rozšíření PHP "zip" je povoleno

source: Your store is in maintenance mode
cs: Váš obchod je v režimu údržby
ru: Магазин находится в режиме технического обслуживания

source: Enable maintenance mode and add your maintenance IP in [1]Shop parameters > General > Maintenance[/1]
cs: Zapněte režim údržby a přidejte vaši IP v sekci [1]Nastavení eshopu > Hlavní > Údržba obchodu[/1]

source: PrestaShop's caching features are disabled
cs: Mezipaměťi PrestaShopu jsou zakázané
ru: Функции кеширования PrestaShop отключены

source: PHP's max_execution_time setting has a high value or is disabled entirely (current value: unlimited)
cs: Nastavení PHP max_execution_time obsahuje vysokou hodnotu nebo je zcela vypnuto (současná hodnota: neomezeně)
ru: Параметр РНР max_execution_time или слишком большой, или отключен (текущее значение: бесконечно)

source: PHP's max_execution_time setting has a high value or is disabled entirely (current value: %s seconds)
cs: Nastavení PHP max_execution_time obsahuje vysokou hodnotu nebo je zcela vypnuto (současná hodnota: %s s)
ru: Параметр РНР max_execution_time или слишком большой, или отключен (текущее значение: %s сек.)

source: Apache mod_rewrite is disabled.
cs: Apache modul mod_rewrite je deaktivovaný.

source: The following PHP extensions are not installed: %s.
cs: Následující rozšíření PHP nejsou nainstalovány: %s.

source: The following PHP extension is not installed: %s.
cs: Následující rozšíření PHP není nainstalováno: %s.

source: PHP memory_limit is inferior to 256 MB.
cs: PHP memory_limit je menší než 256 MB.

source: PHP file_uploads configuration is disabled.
cs: Nastavení PHP file_uploads je zakázáno.

source: The following PHP functions are not installed: %s.
cs: Následující funkce PHP nejsou nainstalovány: %s.

source: The following PHP function is not installed: %s.
cs: Následující funkce PHP není nainstalována: %s.

source: It's not possible to create a PHP session.
cs: Není možné vytvořit PHP session.

source: Unable to generate private keys using openssl_pkey_new. Check your OpenSSL configuration, especially the path to openssl.cafile.
cs: Nepodařilo se vygenerovat privátní klíče pomocí funkce openssl_pkey_new. Zkontrolujte a opravte prosím konfiguraci OpenSSL, např. cestu k openssl.cafile.

source: The following files are missing:
cs: Následující soubory chybí:

source: It's not possible to write in the following folders:
cs: Do následujících složek nelze zapisovat:

source: The version of PrestaShop does not match the one stored in database. Your database structure may not be up-to-date and/or the value of PS_VERSION_DB needs to be updated in the configuration table. [1]Learn more[/1].
cs: Verze PrestaShopu na disku neodpovídá verzi uložené v databázi. Struktura vaší databáze možná není aktuální a/nebo je třeba aktualizovat hodnotu PS_VERSION_DB v tabulce configuration. [1]Další informace[/1].

source: Please also make sure you make a full manual backup of your files and database.
cs: Ujistěte se prosím, že jste provedli kompletní zálohu souborů a databáze.
ru: Также имеет смысл сделать полную резервную копию файлов и базы данных вручную.

source: PrestaShop requirements are not satisfied.
cs: Systémové požadavky PrestaShopu nejsou splněny.

source: Privacy policy
cs: Zásady ochrany soukromí

source: Your restoration is complete
cs: Obnova byla dokončena

source: Before continuing with your tasks, please review the following checklist to ensure smooth operation after recent recovery.
cs: Než budete pokračovat ve svých povinnostech, přečtěte si prosím následující kontrolní seznam, abyste měli jistotu, že vše po obnově poběží hladce.

source: If you can't access your back office, try emptying the cache.
cs: Pokud nebudete mít přístup do administrace, zkuste vymazat cache.

source: Open developer documentation
cs: Otevřít dokumentaci pro vývojáře

source: Next steps
cs: Další kroky

source: Disable the maintenance mode in General settings > Maintenance.
cs: Vypněte režim údržby v části Obecná nastavení > Údržba.

source: Troubleshooting
cs: Řešení problémů

source: Your store is up to date
cs: Váš systém je aktuální

source: Before continuing with your tasks, please review the following checklist to ensure smooth operation after recent updates
cs: Než budete pokračovat ve svých povinnostech, přečtěte si prosím následující kontrolní seznam, abyste měli jistotu, že vše poběží hladce

source: Re-enable and check your modules one by one.
cs: Znovu povolte a zkontrolujte své moduly jeden po druhém.

source: Make sure your store's front office is working properly: try to create an account, place an order, add a product, etc.
cs: Ujistěte se, že front office vašeho obchodu funguje správně: zkuste si vytvořit účet, zadat objednávku, přidat produkt atd.

source: If some images don't appear in the front office, try regenerating thumbnails in Preferences > Images.
cs: Pokud se některé obrázky nezobrazují správně, zkuste přegenerovat miniatury v sekci Vzhled > Nastavení obrázků.

source: If something's wrong, you can restore a backup with this module. Your backup is available at {admin}/autoupgrade/backup.
cs: Pokud se něco pokazí, můžete pomocí tohoto modulu obnovit zálohu. Záloha je k dispozici ve složce {admin}/autoupgrade/backup.

source: If you can't access your back office, try enabling the debug mode manually in config/defines.inc.php by setting _PS_MODE_DEV_ to true.
cs: Pokud nebudete mít přístup do administrace, zkuste ručně povolit režim ladění v souboru config/defines.inc.php nastavením _PS_MODE_DEV_ na hodnotu true.

source: After upgrading your shop, you can rollback to the previous database and files. Use this function if your theme or an essential module is not working correctly.
cs: Po aktualizaci svého obchodu můžete vrátit zpět dřívější databáze a soubory. Pokud Vaše šablona vzhledu nebo základní modul nebude pracovat správně, použijte tuto funkci.
ru: После обновления магазина есть возможность откатиться к предыдущей версии базы данных и файлов. Используйте эту функцию если ваш шаблон или нужный модуль работает некорректно.

source: Choose your backup:
cs: Vyberte zálohu:
ru: Выберите резервную копию:

source: -- Choose a backup to restore --
cs: – Vyberte zálohu, kterou chcete obnovit –
ru: -- Выберите резервную копию для восстановления --

source: More options (Expert mode)
cs: Další možnosti (expertní režim)
ru: Дополнительные параметры (экспертный режим)

source: Save
cs: Uložit
ru: Сохранить

source: Start your Upgrade
cs: Spustit aktualizaci
ru: Начать обновление

source: You come from the future! You are using a more recent version than the latest available!
cs: Přišli jste z budoucnosti? Používáte novější verzi, než která je dostupná!
ru: Вы явились из будущего! Вы используете более свежую версию, чем последняя версия от разработчика!

source: Congratulations, you are already using the latest version available!
cs: Gratulujeme, již používáte nejnovější dostupnou verzi!
ru: Поздравляем, вы используете последнюю доступную версию!

source: Your current PrestaShop version
cs: Vaše aktuální verze PrestaShopu
ru: Актуальная версия Вашего магазина

source: Your current PHP version
cs: Vaše současná verze PHP

source: Latest official version for %s channel.
cs: Poslední oficiální verze pro kanál %s.
ru: Последняя официальная версия на канале %s.

source: Upgrade PrestaShop now!
cs: Aktualizovat PrestaShop!
ru: Начать обновление PrestaShop!

source: PrestaShop will be downloaded from %s
cs: PrestaShop bude stažen z %s
ru: PrestaShop будет загружен с %s

source: Open changelog in a new window
cs: Otevřít seznam změn v novém okně
ru: Открыть список изменений в новом окне

source: No file will be downloaded (channel %s is used)
cs: Nebude stažen žádný soubor (používá se kanál %s)
ru: Ни один файл не будет загржен (используется канал %s)
