Repository: PrestaShop/autoupgrade
Catalog: translations/ModulesAutoupgradeAdmin.*.xlf
Languages: cs, ru

source: The following action are automatically replaced
cs: Následující akce jsou automaticky nahrazeny
ru: Следующие действия автоматически заменены

source: %old% will be replaced by %new%
cs: %old% bude nahrazen %new%
ru: %old% будет заменено на %new%

source: To change this behavior, you need to manually edit your php files
cs: Chcete-li toto chování změnit, musíte ručně upravit své PHP soubory
ru: Для изменения такого поведения, вам необходимо вручную изменить ваши файлы php

source: Refresh the page
cs: Aktualizovat stránku
ru: Обновить страницу

source: Check if a new version is available
cs: Zkontroluj dostupnost nové verze
ru: Проверить наличие новой версии

source: Last check: %s
cs: Poslední kontrola: %s
ru: Последняя проверка: %s

source: Last check: never
cs: Poslední kontrola: nikdy
ru: Последняя проверка: никогда

source: Expert mode
cs: Expertní režim
ru: Режим эксперта

source: Please select your channel:
cs: Prosím vyberte kanál:
ru: Пожалуйста, выберите канал:

source: Channels are offering you different ways to perform an upgrade. You can either upload the new version manually or let the 1-Click Upgrade module download it for you.
cs: Kanály Vám nabízí různé způsoby, jak provést aktualizaci. Buď můžete nahrát novou verzi ručně nebo nechat tento modul provést aktualizaci za Vás.
ru: Каналы позволяют вам выбирать способ обновления. Вы можете загрузить новую версию вручную или разрешить модулю 1-click upgrade самому осуществить загрузку обновления.

source: The Alpha, Beta and Private channels give you the ability to upgrade to a non-official or unstable release (for testing purposes only).
cs: Alfa, beta a soukromé kanály Vám umožní aktualizaci na neoficiální nebo nestabilní verze (pouze pro testovací účely).
ru: Каналы альфа, бета и частные каналы дают вам возможность обновляться до неофициальных или нестабильных релизов (только для целей тестирования).

source: By default, you should use the "Minor release" channel which is offering the latest stable version available.
cs: Ve výchozím nastavení byste měli použít kanál "Minor", kde jsou dostupné nejnovější stabilní verze.
ru: Рекомендуется использовать канал "минорные выпуски", предлагающий последнюю доступную стабильную версию.

source: Channel:
cs: Kanál:
ru: Канал:

source: Link:
cs: Odkaz:
ru: Ссылка:

source: Hash key:
cs: Hash klíč:
ru: Хеш-ключ:

source: Allow major upgrade:
cs: Povolit velké aktualizace (major):
ru: Разрешить мажорные обновления:

source: Archive to use:
cs: Archiv k použití:
ru: Использовать архив:

source: Choose an archive
cs: Vyberte archiv
ru: Выберите архив

source: XML file to use:
cs: XML soubor, který použít:

source: Choose an XML file
cs: Vyberte XML soubor

source: No archive found in your admin/autoupgrade/download directory
cs: V adresáři admin/autoupgrade/download nebyl nalezen žádný archiv
ru: Не найден архив в директории admin/autoupgrade/download

source: Save in the following directory the archive file and XML file of the version you want to upgrade to: %s
cs: Do následujícího adresáře uložte archiv s instalací a XML soubor verze, na kterou chcete upgradovat: %s

source: Click to save once the archive is there.
cs: Až tam vložíte archiv, klikněte na uložit.

source: This option will skip the download step.
cs: Tato volba přeskočí krok stahování.
ru: При включении этой опции будет пропущен этап загрузки.

source: Save in the following directory the uncompressed PrestaShop files of the version you want to upgrade to: %s
cs: Do následujícího adresáře uložte rozbalené soubory PrestaShopu ve verzi, na kterou chcete upgradovat: %s
ru: Сохраните распакованные файлы обновления в эту директорию: %s

source: Please tell us which version you are upgrading to [1](1.7.0.1 for instance)[/1]
cs: Sdělte nám prosím, na jakou verzi upgradujete [1](například 1.7.0.1)[/1]
ru: Пожалуйста, сообщите нам, какую версию вы обновляете до [1](например, 1.7.0.1)[/1]

source: This option will skip both download and unzip steps and will use %1$s as the source directory
cs: Tato volba přeskočí kroky stahování a rozbalování a jako zdroj bude použít adresář %1$s
ru: Эта опция пропускает шаги загрузки и распаковки. В качестве источника обновления будет использована директория %1$s

source: Version comparison
cs: Srovnání verzi
ru: Сравнение версий

source: PrestaShop Original version
cs: Původní verze PrestaShopu
ru: Оригинальная версия PrestaShop

source: Differences between versions
cs: Rozdíly mezi verzemi
ru: Отличия между версиями

source: Welcome!
cs: Vítejte!
ru: Добро пожаловать!

source: Upgrade your store to benefit from the latest improvements, bug fixes and security patches.
cs: Aktualizujte váš obchod abyste získali nejnovější vylepšení, opravy chyb a bezpečnostní záplaty.

source: Upgrading your store on your own can be risky. If you don't feel comfortable doing the upgrade yourself, many agencies and developers in your area may also provide this kind of service.
cs: Aktualizace obchodu na vlastní pěst může být riskantní. Pokud se na to sami necítíte, spousta agentur a specialistů tuto službu poskytuje.

source: [SQL ERROR]
ru: [ОШИБКА SQL]

source: Rollback
ru: Откат
