Repository: PrestaShop/autoupgrade
Catalog: translations/ModulesAutoupgradeAdmin.*.xlf
Languages: cs, ru

source: Action %s skipped
cs: Akce %s přeskočena
ru: Действие %s пропущено

source: Unable to check files for the installed version of PrestaShop.
cs: Z nainstalovaných souborů nebylo možné zjistit verzi PrestaShop.
ru: Невозможно проверить файлы установленной версии PrestaShop.

source: Core files are ok
cs: Základní soubory (core) jsou v pořádku
ru: Основные файлы в порядке

source: %modificationscount% file modifications have been detected, including %coremodifications% from core and native modules:
cs: Bylo zjištěno %modificationscount% modifikací souborů, včetně %coremodifications% ze základních a nativních modulů:
ru: Обнаружено измененных файлов: %modificationscount%, включая %coremodifications% из ядра и нативных модулей:

source: %modifiedfiles% files will be modified, %deletedfiles% files will be deleted (if they are found).
cs: Soubory %modifiedfiles% budou modifikovány, soubory %deletedfiles% budou smazány (pokud budou nalezeny).
ru: Будет модифицировано файлов: %modifiedfiles%, удалено (при обнаружении): %deletedfiles%.

source: File %s does not exist. Unable to select that channel.
cs: Soubor %s neexistuje. Nelze vybrat tento kanál.
ru: файл %s не существует. Невозможно выбрать данный канал.

source: Unable to retrieve version from zip: %s.
cs: Nelze načíst verzi ze zipu: %s.

source: Prestashop version detected in the xml (%s) does not match the zip version (%s).
cs: Verze Prestahopu zjištěná v xml (%s) neodpovídá verzi v zipu (%s).

source: Upgrade process will use archive.
cs: Proces aktualizace bude používat archiv.
ru: Для обновления будет использоваться архив.

source: Version number is missing. Unable to select that channel.
cs: Chybí číslo verze. Tento kanál nelze vybrat.
ru: Отсутствует номер версии. Не могу выбрать этот канал.

source: Error on saving configuration
cs: Chyba uložení konfigurace
ru: Ошибка при сохранении конфигурации

source: Configuration successfully updated.
cs: Nastavení bylo aktualizováno.
ru: Конфигурация обновлена.

source: This page will now be reloaded and the module will check if a new version is available.
cs: Tato stránka bude nyní znovu načtena a zkontroluje se, zda není dostupná nová verze modulu.
ru: Эта страница будет перезагружена и модуль проверит наличие доступных обновлений.

source: Nothing to restore
cs: Nic k obnovení
ru: Данные для восстановления отсутствуют

source: %s: File format does not match.
cs: %s: formát souboru neodpovídá.
ru: %s: Формат файла не подходит.

source: Opening backup database file %filename% in %extension% mode
cs: Otevírání souboru záložní databáze %filename% v režimu %extension%
ru: Открываем резервную копию БД %filename% в режиме %extension%

source: Database backup is empty.
cs: Záloha databáze je prázdná.
ru: Резервная копия базы данных пуста.

source: Database restoration file %filename% done. %filescount% file(s) left...
cs: Soubor obnovení databáze %filename% vytvořen. Zbývá %filescount% souborů...
ru: Файл восстановления базы данных %filename% готов. Осталось файлов: %filescount%...

source: Database restoration file %1$s done.
cs: Obnova souboru databáze %1$s byla dokončena.
ru: Файл восстановления базы данных %1$s обработан.

source: Database has been restored.
cs: Databáze byla obnovena.
ru: База данных восстановлена.

source: Error during database restoration
cs: Nastala chyba během aktualizace databáze
ru: Ошибка при восстановлении базы данных

source: %numberqueries% queries left for file %filename%...
cs: Zbývá %numberqueries% dotazů pro soubor %filename%...
ru: В файле %filename% осталось запросов: %numberqueries%...

source: Database restoration done.
cs: Obnovení databáze dokončeno.
ru: Восстановление базы данных завершено.

source: %s file(s) will be removed before restoring the backup files.
cs: Před obnovením záložních souborů bude odstraněno %s soubor(ů).
ru: Перед восстановлением из резервной копии будет удалено файлов: %s.

source: [ERROR] Backup file %s does not exist.
cs: [ERROR] Soubor se zálohou %s nebyl nalezen.
ru: [ERROR] Файла резервной копии %s не существует.

source: [ERROR] File "%s" does not exist.
cs: [ERROR] Soubor "%s" nebyl nalezen.
ru: [ERROR] Файла %s не существует.

source: Unable to remove upgraded files.
cs: Nelze odstranit aktualizované soubory.
ru: Невозможно удалить обновленные файлы.

source: Unable to extract file %filename% into directory %directoryname%.
cs: Nelze rozbalit soubor %filename% do adresáře %directoryname%.
ru: Не удалось извлечь файл %filename% в директорию %directoryname%.

source: Files restored.
cs: Soubory obnoveny.
ru: Файлы восстановлены.

source: Files restored. Now restoring database...
cs: Soubory byly obnoveny. Nyní probíhá obnovení databáze...
ru: Файлы восстановлены. Идёт восстановление базы данных...

source: [ERROR] File %s is missing: unable to restore files. Operation aborted.
cs: [ERROR] Soubor %s chybí: nebylo možné obnovit soubory. Operace byla zrušena.
ru: [ERROR] Отсутствует файл %s: восстановление невозможно. Действие отменено.

source: [ERROR] No backup database files found: it would be impossible to restore the database. Operation aborted.
cs: [ERROR] Nebyly nalezeny žádné soubory se zálohou databáze: není možné obnovit databázi. Operace byla zrušena.
ru: [ERROR] Восстановление базы данных невозможно: не найдены файлы резервных копий. Действие отменено.

source: Restoring files ...
cs: Obnovuji soubory...
ru: Восстановление файлов ...

source: Restoration process done. Congratulations! You can now reactivate your shop.
cs: Procesu obnovy byl dokončen. Gratulujeme! Nyní můžete spustit svůj obchod.
ru: Процесс восстановления завершен. Поздравляем! Теперь вы можете активировать ваш магазин.

source: Database backup skipped. Now upgrading files...
cs: Zálohování databáze bylo přeskočeno. Teď probíhá aktualizace souborů...
ru: Создание резервной копии базы данных пропущено. Начинается обновление файлов...

source: Backup directory is not writable (%path%).
cs: Adresář zálohy není zapisovatelný (%path%).
ru: Запись в директорию резервных копий запрещена (%path%).

source: Backup file %s already exists. Operation aborted.
cs: Záložní soubor %s již existuje. Operace byla přerušena.
ru: Файл резервной копии %s уже существует. Действие отменено.

source: Unable to create backup database file %s.
cs: Nebylo možné vytvořit soubor se zálohou databáze %s.
ru: Невозможно создать файл резервной копии базы данных %s.

source: Error during database backup.
cs: Chyba při zálohování databáze.
ru: Ошибка при создании резервной копии базы данных.

source: An error occurred while backing up. Unable to obtain the schema of %s
cs: Došlo k chybě při zálohování. Nelze získat schéma z %s
ru: При создании резервной копии возникла ошибка. Невозможно получить схему %s

source: %s table has been saved.
cs: %s tabulka byla uložena.
ru: Таблица %s сохранена.

source: %s tables have been saved.
cs: %s tabulek bylo uloženo.
ru: Сохранено таблиц: %s.

source: Database backup: %s table(s) left...
cs: Záloha databáze: zbývá %s tabulek...
ru: Резервное копирование базы данных. Осталось таблиц: %s...

source: No valid tables were found to back up. Backup of file %s canceled.
cs: Nebyly nalezeny platné tabulky k záloze. Záloha souboru %s byla zrušena.
ru: Подходящих для резервирования таблиц не обнаружено. Резервное копирование файла %s отменено.

source: Error during database backup for file %s.
cs: Došlo k chybě při záloze databáze (soubor %s).
ru: Ошибка при резервировании базы данных в файл %s.

source: Database backup done in filename %s. Now upgrading files...
cs: Záloha databáze byla vytvořena do souboru %s. Nyní probíhá aktualizace souborů...
ru: Резервная копия базы данных сохранена в файл %s. Идет обновление файлов...

source: Error during backupFiles
cs: Došlo k chybě během fáze backupFiles
ru: Ошибка при резервном копировании файлов

source: [ERROR] backupFiles filename has not been set
cs: [ERROR] nebyl nastaven název souboru pro backupFiles
ru: [ERROR] Имя файла резервной копии не задано

source: %s Files to backup.
cs: %s souborů k zálohování.
ru: Файлов для резервного копирования: %s.

source: Backup files initialized in %s
cs: Soubory zálohy inicializovány za %s
ru: Резервное копирование производится в %s

source: Backup files in progress. %d files left
cs: Probíhá záloha souborů. %d souborů zůstává
ru: Копирование файлов. Осталось: %d

source: Unable to open archive
cs: Nelze otevřít archiv
ru: Не удалось открыть архив

source: All files have been added to archive.
cs: Všechny soubory byly přidány do archivu.
ru: Все файлы добавлены в архив.

source: All files saved. Now backing up database
cs: Všechny soubory byly uloženy. Nyní probíhá záloha databáze
ru: Все файлы сохранены. Идет резерное копирование базы данных

source: The database has been cleaned.
cs: Databáze byla vyčištěna.
ru: База данных очищена.

source: You need allow_url_fopen or cURL enabled for automatic download to work. You can also manually upload it in filepath %s.
cs: Aby bylo automatické stahování funkční, je potřeba povolit direktivu allow_url_open nebo nainstalovat rozšíření cURL. Můžete také nahrát data ručně do umístění %s.
ru: Вы должны включить allow_url_fopen или cURL для работы автоматической загрузки. Также возможна ручная загрузка файлов в %s.

source: Downloading from %s
cs: Stahování z %s
ru: Загрузка из %s

source: File will be saved in %s
cs: Soubor bude uložen v %s
ru: Файл будет сохранён в %s

source: Download directory has been emptied
cs: Adresář pro stažení byl vyprázdněn
ru: Директория загрузок очищена

source: Download complete.
cs: Stahování je kompletní.
ru: Загрузка завершена.

source: Download complete. Now extracting...
cs: Stahování bylo dokončeno. Nyní probíhá rozbalování...
ru: Загрузка завершена. Идет распаковка...

source: Download complete but MD5 sum does not match (%s).
cs: Stahování bylo dokončeno, ale kontrolní součet MD5 neodpovídá (%s).
ru: Загрузка завершена, однако суммы MD5 не совпадают (%s).

source: Download complete but MD5 sum does not match (%s). Operation aborted.
cs: Stahování bylo dokončeno, ale kontrolní součet MD5 neodpovídá (%s). Operace byla zrušena.
ru: Загрузка завершена, однако суммы MD5 не совпадают (%s). Действие отменено.

source: Error during download. The private key may be incorrect.
cs: Chyba při stahování. Soukromý klíč může být nesprávný.
ru: Ошибка при загрузке. Возможно, из-за некорректного закрытого ключа.

source: Error during download
cs: Došlo k chybě během stahování
ru: Ошибка при загрузке

source: Download directory %s is not writable.
cs: Adresář pro stažení %s není zapisovatelný.
ru: Невозможна запись в директорию загрузок %s.

source: "/latest" directory has been emptied
cs: Složka "/latest" byla vyprázdněna
ru: Директория "/latest" очищена

source: Extraction directory %s is not writable.
cs: Adresář pro rozbalení souborů %s není zapisovatelný.
ru: Директория %s защищена от записи.

source: Unable to extract %filepath% file into %destination% folder...
cs: Soubor %filepath% nelze extrahovat do složky %destination%...
ru: Невозможно распаковать файл %filepath% в папку %destination%...

source: No prestashop/ folder found in the ZIP file. Aborting.
cs: V souboru ZIP nenalezena složka prestashop/. Ukončuji.
ru: В архиве отсутствует папка prestashop/. Отмена действия.

source: File extraction complete. Now backing up files...
cs: Rozbalování souboru dokončeno. Probíhá záloha souborů...

source: Upgrade process done, but some warnings have been found.
cs: Proces aktualizace proběhl, ale s varováním.
ru: Обновление завершено, но при этом возникли предупреждения.

source: Upgrade process done. Congratulations! You can now reactivate your shop.
cs: Proces aktualizace byl dokončen. Gratulujeme! Nyní můžete znovu spustit Váš obchod.
ru: Процесс обновления завершен. Поздравляем! Теперь вы можете активировать ваш магазин.

source: %s removed
cs: %s odstraněn
ru: %s удалён

source: Please remove %s by FTP
cs: Prosím odstranit %s přes FTP
ru: Удалите %s на FTP

source: Error during database upgrade. You may need to restore your database.
cs: Došlo k chybě při aktualizaci databáze. Možná bude nutné provést její obnovu ze zálohy.
ru: Ошибка в процессе обновления базы данных. Вашей базе данных может потребоваться восстановление.

source: Database upgraded. Now upgrading your Addons modules...
cs: Databáze byla aktualizována. Nyní probíhá aktualizace modulů...
ru: База данных обновлена. Начинается обновление модулей дополнений...

source: All files upgraded. Now upgrading database...
cs: Všechny soubory byly aktualizovány. Nyní probíhá aktualizace databáze...
ru: Все файлы обновлены. Начинается обновление базы данных...

source: Error when trying to upgrade file %s.
cs: Došlo k chybě při pokusu o aktualizaci souboru %s.
ru: Ошибка при попытке обновления файла %s.

source: %s files left to upgrade.
cs: Zbývá aktualizovat %s souborů.
ru: Осталось обновить файлов: %s.

source: %s ignored
cs: %s ignorováno
ru: %s проигнорировано

source: [WARNING] File %1$s has been deleted.
cs: [WARNING] Soubor %1$s byl odstraněn.
ru: [WARNING] Файл %1$s удалён.

source: Directory %1$s created.
cs: Adresář %1$s byl vytvořen.
ru: Директория %1$s создана.

source: Error while creating directory %s.
cs: Došlo k chybě při vytváření složky %s.
ru: Ошибка при создании директории %s.

source: Directory %s already exists.
cs: Adresář %s již existuje.
ru: Директория %s уже существует.

source: [TRANSLATION] The translation files have been merged into file %s.
cs: [TRANSLATION] Soubory překlady byly sloučeny do souboru %s.
ru: [TRANSLATION] Файлы перевода объединены в файл %s.

source: [TRANSLATION] The translation files have not been merged into file %filename%. Switch to copy %filename%.
cs: [TRANSLATION] Soubory překladu nebyly sloučeny do souboru %filename%. Přepnout na kopii %filename%.
ru: [TRANSLATION] Не удалось объединить файлы перевода в файл %filename%. Переключение на копию %filename%.

source: Copied %1$s.
cs: Zkopírováno %1$s.
ru: Скопировано %1$s.

source: Error while copying file %s
cs: Chyba při kopírování souboru %s
ru: Ошибка копирования файла %s

source: Could not assert the folder %s contains a valid PrestaShop release, exiting.
cs: Nepodařilo se ověřit, že ve složce %s je validní instalace PrestaShopu, končím.
ru: Завершение, так как не удаётся проверить, что папка %s содержит корректную версию PrestaShop.

source: A file may be missing, or the release is stored in a subfolder by mistake.
cs: Může chybět nějaký soubor, nebo je instalace omylem v nějaké podsložce.
ru: Возможно, отсутствует файл или релиз был по ошибке помещён в подпапку.

source: [ERROR] Unable to find files to upgrade.
cs: [ERROR] Nebylo možné najít soubory k aktualizaci.
ru: [ERROR] Невозможно найти файлы для обновления.

source: %s files will be upgraded.
cs: %s souborů bude aktualizováno.
ru: Файлов для обновления: %s.

source: Updating module %module%...
cs: Probíhá aktualizace modulu %module%...

source: [WARNING] Error when trying to retrieve module %s instance.
cs: [VAROVÁNÍ] Nepodařilo se získat instanci modulu %s.

source: Module %s does not need to be migrated. Module is up to date.
cs: Modul %s není potřeba migrovat, je aktuální.

source: %s modules left to upgrade.
cs: %s modulů bude aktualizováno.
ru: осталось обновить модулей: %s.

source: Addons modules files have been upgraded.
cs: Moduly Addons byly zaktualizovány.
ru: Модули дополнений были обновлены.

source: %s modules will be upgraded.
cs: %s modulů bude aktualizováno.
ru: будет обновлено модулей: %s.

source: Starting upgrade...
cs: Začínám aktualizovat...
ru: Начинается обновление...

source: Downloading and unzipping steps have been skipped, upgrade process will now remove sample data.
cs: Bylo přeskočeno stažení a rozbalení archivu, proces aktualizace bude nyní pokračovat odstraněním vzorových dat.
ru: Этапы загрузки и распаковки пропущены, теперь обновление удалит демо-данные.

source: Shop deactivated. Now backing up files...
cs: Obchod deaktivován. Probíhá záloha souborů...

source: Downloading step has been skipped, upgrade process will now unzip the local archive.
cs: Bylo přeskočeno stahování, proces aktualizace nyní rozbalí místní archiv.
ru: Этап загрузки пропущен, начинается распаковка локального архива.

source: Shop deactivated. Extracting files...
cs: Obchod je deaktivován. Rozbaluji soubory...
ru: Магазин деактивирован. Извлечение файлов...

source: Shop deactivated. Now downloading... (this can take a while)
cs: Obchod byl deaktivován. Nyní probíhá stahování... (toto může chvíli trvat)
ru: Магазин деактивирован. Идет загрузка... (это займет некоторое время)

source: Downloaded archive will come from %s
cs: Stahovaný archív pochází z %s
ru: Архив будет загружен из %s

source: MD5 hash will be checked against %s
cs: Kontrolní součet MD5 bude zkontrolován oproti %s
ru: Сравнение хеш-суммы MD5 с %s

source: N/A
cs: Nedostupné
ru: нет

source: Major release
cs: Hlavní - major verze
ru: Основной релиз

source: Minor release (recommended)
cs: Vedlejší - minor verze (doporučeno)
ru: Минорный выпуск (рекомендовано)

source: Release candidates
cs: Release candidates verze
ru: Предварительные выпуски

source: Beta releases
cs: Beta verze
ru: Бета-релизы

source: Alpha releases
cs: Alfa verze
ru: Альфа-релизы

source: Private release (require link and MD5 hash)
cs: Soukromá verze (vyžaduje odkaz a kontrolní součet MD5)
ru: Частные релизы (требуется ссылка и хеш MD5)

source: Local archive
cs: Místní archiv
ru: Локальный архив

source: Local directory
cs: Místní adresář
ru: Локальная директория

source: Back up my files and database
cs: Zálohovat moje soubory a databázi

source: Automatically back up your database and files in order to restore your shop if needed. This is experimental: you should still perform your own manual backup for safety.
cs: Automaticky zálohovat vaši databázi a soubory pro případnou obnovu obchodu v případě potřeby. Toto je experimentální a pro jistotu byste měli provádět zálohu ve vlastní režii.

source: Back up my images
cs: Zálohovat obrázky

source: To save time, you can decide not to back your images up. In any case, always make sure you did back them up manually.
cs: Pro úsporu času můžete vynechat zálohu vašich obrázků. V každém případě se však ujistěte, že jste je zálohovali ručně.

source: Backup Options
cs: Možnosti zálohování
ru: Опции резервного копирования

source: Yes
cs: Ano
ru: Вкл

source: No
cs: Ne
ru: Выкл

source: Server performance
cs: Výkon serveru

source: Unless you are using a dedicated server, select "Low".
cs: Pokud nepoužíváte soukromý server, vyberte možnost "Nízká".

source: A high value can cause the upgrade to fail if your server is not powerful enough to process the upgrade tasks in a short amount of time.
cs: Vysoká hodnota může způsobit, že se aktualizace nezdaří, pokud váš server není tak rychlý, aby zprocesoval aktualizaci v krátkém čase.

source: Low (recommended)
cs: Nízká (doporučeno)

source: Medium
cs: Střední

source: High
cs: Vysoká

source: Disable non-native modules
cs: Zakázat nepůvodní moduly

source: As non-native modules can experience some compatibility issues, we recommend to disable them by default.
cs: U externích modulů můžou být občas problémy s kompatibilitou, standardně je doporučujeme je vypnout.

source: Keeping them enabled might prevent you from loading the "Modules" page properly after the upgrade.
cs: Pokud je necháte zapnuté, může se stát, že stránka s moduly nepůjde po upgrade načíst.

source: Disable all overrides
cs: Zakázat všechny overridy

source: Enable or disable all classes and controllers overrides.
cs: Povolit nebo zakázat všechny overridy tříd a kontrolerů.

source: Upgrade the default theme
cs: Aktualizovat výchozí šablonu

source: If you customized the default PrestaShop theme in its folder (folder name "classic" in 1.7), enabling this option will lose your modifications.
cs: Pokud jste upravili výchozí šablonu vzhledu PrestaShopu ve výchozí složce (složka "classic" ve verzi 1.7), pak při povolení této možnosti přijdete o své změny.

source: If you are using your own theme, enabling this option will simply update the default theme files, and your own theme will be safe.
cs: Pokud používáte vlastní šablonu vzhledu, dojde při povolení této možnosti k přepnutí šablony na výchozí, aktualizovanou šablonu. Vaše vlastní šablona bude zachována.

source: Regenerate RTL stylesheet
cs: Vygenerovat RTL styly

source: If enabled, any RTL-specific files that you might have added to all your themes might be deleted by the created stylesheet.
cs: Pokud tuto funkci povolíte, RTL soubory ve všech šablonách můžou být odstraněny vytvořeným CSS souborem.

source: Switch to the default theme
cs: Přepnout na výchozí šablonu

source: This will change your theme: your shop will then use the default theme of the version of PrestaShop you are upgrading to.
cs: Tato akce změní vaší šablonu: váš obchod bude poté používat výchozí šablonu verze Prestashopu, na kterou provádíte upgrade.

source: Keep the customized email templates
cs: Ponechat upravené šablony emailů

source: This will not upgrade the default PrestaShop e-mails.
cs: Tímto nedojde k upgradu výchozích e-mailů PrestaShopu.

source: If you customized the default PrestaShop e-mail templates, enabling this option will keep your modifications.
cs: Pokud jste upravili výchozí šablony e-mailů PrestaShopu, povolením této možnosti nepřijdete o své změny.

source: Upgrade Options
cs: Možnosti aktualizace
ru: Опции обновления

source: This functionality has been disabled.
cs: Tato funkce byla deaktivována.
ru: Эти функции отключены.

source: [TECHNICAL ERROR] ajax-upgradetab.php is missing. Please reinstall or reset the module.
cs: [TECHNICAL ERROR] Chybí soubor ajax-upgradetab.php. Prosím přeinstalujte nebo resetujte modul.
ru: [TECHNICAL ERROR] Отсутствует ajax-upgradetab.php. Переустановите или сбросьте модуль в начальное состояние.

source: Are you sure you want to delete this backup?
cs: Jste si jisti, že chcete smazat tuto zálohu?
ru: Вы точно хотите удалить эту резервную копию?

source: Delete
cs: Odstranit
ru: Удаление

source: An update is currently in progress... Click "OK" to abort.
cs: Probíhá aktualizace... Klikněte na tlačítko "OK" pro zrušení.
ru: Идет процесс обновления... Нажмите "ОК" для отмены.

source: Upgrading PrestaShop
cs: Aktualizace PrestaShopu
ru: Обновление PrestaShop

source: Upgrade complete
cs: Aktualizaci je kompletní
ru: Обновление завершено

source: Upgrade complete, but warning notifications has been found.
cs: Aktualizace byla dokončena, ale byla zaznamenána upozornění.
ru: Обновление завершено, но возникли предупреждения.

source: Starting restoration...
cs: Spuštění obnovy...
ru: Начинается восстановление...

source: Restoration complete.
cs: Obnova byla dokončena.
ru: Восстановление завершено.

source: Your server cannot download the file. Please upload it first by ftp in your admin/autoupgrade directory
cs: Váš server nemůže stáhnout soubor. Nahrajte jej přes FTP do vašeho adresáře admin/autoupgrade
ru: Ваш сервер не может загрузить файл. Загрузите его по протоколу ftp в директорию admin/autoupgrade

source: Javascript error (parseJSON) detected for action
cs: Zjištěna chyba JavaScriptu (parseJSON) pro akci
ru: Для данного действия обнаружена ошибка Javascript (parseJSON)

source: End of process
cs: Konec procesu
ru: Обновление завершено

source: Operation canceled. Checking for restoration...
cs: Operace byla zrušena. Kontroluji možnost obnovení...
ru: Действие отменено. Проверка возможности восстановления...

source: Do you want to restore %s?
cs: Chcete obnovit %s?
ru: Вы хотите восстановить %s?

source: Operation canceled. An error happened.
cs: Operace byla zrušena. Došlo k chybě.
ru: Действие отменено из-за ошибки.
